<?php

// имя сервера:
$HOST = "localhost";
// пользователь базы данных MySQL
$USER = "root";
// пароль для доступа к серверу MySQL
$PASS = "";
// название базы данных
$db_name = 'alenka';
// таблица пользователей
$db_user_table = 'users';
//всплывающая подсказка для логина
$t_login = 'Логин может состоять только из латинских букв, цифр, тире и нижнего подчеркивания. Длина не менее 5-ти символов, но не более 25';
//всплывающая подсказка для пароля
$t_pass = 'Пароль может состоять только из латинских букв, цифр, тире и нижнего подчеркивания. Длина не менее 5-ти символов, но не более 25';
//всплывающая подсказка для кнопки
$t_bottom = 'Нажимая кнопку Вы соглашаетесь со всеми правилами данного сайта.';
//текст перед регистрацией. Для отмены оставить поле пустым
$reg_text = 'Алёнка, вот тебе пример регистрации, написанный за ночь:';
//роль присваемая при регистрации по умолчанию
$user_role = 10;
?>